---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionInputElements
source: html/3e9fa6ec-3739-b5cb-e0a7-ebea6149b24b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionInputElements Property

"Input Elements"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionInputElements { get; }
```